In [40]:
%run cases.ipynb

In [16]:
%run deaths.ipynb

# UK

# England

# Scotland

# Wales

# Northern Ireland

# Total E&S Region
_Combining Black Country, Birmingham and Staffordshire._

In [2]:
get_latest_cases(utlacodes_expressandstar)

          date  new cases  cumulative cases
44  2020-04-15         10              5497

In [5]:
get_latest_deaths_by_group(group_expressandstar)

  date reported  deaths  reporting diff
0    2020-04-17    1362              69

# Total Black Country and Birmingham

In [7]:
get_latest_cases(utlacodes_blackcountry)

          date  new cases  cumulative cases
41  2020-04-15          1              2224

In [8]:
get_latest_cases(utlacodes_blackcountryandbirmingham)

          date  new cases  cumulative cases
42  2020-04-15          1              4206

In [9]:
get_latest_deaths_by_group(group_blackcountryandbirmingham)

  date reported  deaths  reporting diff
0    2020-04-17    1246              64

# Wolverhampton

In [12]:
get_latest_cases(utlacodes_wolverhampton)

          date  new cases  cumulative cases
39  2020-04-15          0               501

In [15]:
get_latest_deaths_by_group(group_wolverhampton)

  date reported  deaths  reporting diff
0    2020-04-17     189               7

# Walsall

In [19]:
get_latest_cases(utlacodes_walsall)

          date  new cases  cumulative cases
37  2020-04-15          0               609

In [20]:
get_latest_deaths_by_group(group_walsall)

  date reported  deaths  reporting diff
0    2020-04-17      99               1

# Dudley

In [21]:
get_latest_cases(utlacodes_dudley)

          date  new cases  cumulative cases
37  2020-04-15          0               490

In [22]:
get_latest_deaths_by_group(group_dudley)

  date reported  deaths  reporting diff
0    2020-04-17     165               3

# Sandwell and Birmingham

In [25]:
get_latest_cases(utlacodes_sandwell)

          date  new cases  cumulative cases
35  2020-04-15          1               624

In [27]:
get_latest_cases(utlacodes_birmingham)

          date  new cases  cumulative cases
41  2020-04-15          0              1982

In [28]:
get_latest_cases(utlacodes_sandwellandbirmingham)

          date  new cases  cumulative cases
41  2020-04-15          1              2606

In [29]:
get_latest_deaths_by_group(group_sandwellandbirmingham)

  date reported  deaths  reporting diff
0    2020-04-17     793              53

# Staffordshire

In [37]:
get_latest_cases(utlacodes_staffordshire)

          date  new cases  cumulative cases
41  2020-04-15          6              1051

In [36]:
get_latest_cases(utlacodes_stoke)

          date  new cases  cumulative cases
31  2020-04-15          3               240

In [35]:
get_latest_cases(utlacodes_staffordshireandstoke)

          date  new cases  cumulative cases
41  2020-04-15          9              1291

## Total Staffordshire Deaths
_North Staffordshire Combined Healthcare NHS Trust (RLY) + University Hospitals of North Midlands NHS Trust (RJE)_

In [38]:
get_latest_deaths_by_group(group_staffordshire)

  date reported  deaths  reporting diff
0    2020-04-17     116               5

# Worcestershire

In [41]:
get_latest_cases(utlacodes_worcestershire)

          date  new cases  cumulative cases
37  2020-04-15          0               718

In [42]:
get_latest_deaths_by_group(group_worcestershire)

  date reported  deaths  reporting diff
0    2020-04-17     128               7